In [1]:
# Beginner Lesson 1 - Python Basics

print("Hello, Data Science!")

# Variables
name = "Monica"
city = "Savannah"
fav_number = 7

print(f"My name is {name}, I live in {city}, and my favorite number is {fav_number}.")

Hello, Data Science!
My name is Monica, I live in Savannah, and my favorite number is 7.

In [2]:
import pandas as pd

# Load a sample dataset
url = "https://people.sc.fsu.edu/~jburkardt/data/csv/airtravel.csv"
data = pd.read_csv(url)

# Show the first 5 rows
data.head()

  Month   "1958"   "1959"   "1960"
0   JAN      340      360      417
1   FEB      318      342      391
2   MAR      362      406      419
3   APR      348      396      461
4   MAY      363      420      472